Repository: MesseBasseProduction/MonDourdannais
Catalog: lib/src/localization/app_*.arb
Languages: de

# httpServerErrorToastTitle
source: The server seems messed up
de: Der Server scheint gestört zu sein

# httpServerErrorToastDescription
source: The server didn't responsed has it should. Please contact support for assistance with error code {field}.
de: Der Server hat nicht wie erwartet geantwortet. Bitte wenden Sie sich an den Support, um Hilfe zum Fehlercode {field} zu erhalten.

# httpWrongResponseToastTitle
source: Unexpected server response
de: Unerwartete Serverantwort

# httpWrongResponseToastDescription
source: The server didn't responsed as usual. Please contact support for assistance with error code {field}.
de: Der Server hat nicht wie üblich geantwortet. Bitte wenden Sie sich an den Support, um Hilfe zum Fehlercode {field} zu erhalten.

# httpFrontErrorToastTitle
source: Application error
de: Anwendungsfehler

# httpFrontErrorToastDescription
source: Something went wrong when trying to reach the server. Please contact support for assistance with error code {field}.
de: Beim Versuch, den Server zu erreichen, ist ein Fehler aufgetreten. Bitte wenden Sie sich an den Support, um Hilfe zum Fehlercode {field} zu erhalten.

# authLoginTitle
source: Login
de: Anmeldung

# authLoginUsernameInput
source: Username or email
de: Benutzername oder E-Mail

# authLoginUsername
source: username
de: benutzername

# authLoginPasswordInput
source: Password
de: Passwort

# authLoginPassword
source: password
de: passwort

# authLoginForgotPassword
source: Forgot your password?
de: Haben Sie Ihr Passwort vergessen?

# authLoginSubmit
source: Login
de: Anmeldung

# authLoginNoAccount
source: Don't have an account?
de: Sie haben noch kein Konto?

# authLoginRegister
source: Register
de: Registrieren

# authLoginInvalidCredentials
source: Invalid credentials, either incorrect or non-existing
de: Ungültige Anmeldeinformationen, entweder falsch oder nicht vorhanden

# authLoginEmptyCredentials
source: Empty credentials received
de: Es wurden leere Anmeldeinformationen empfangen

# authLoginSuccessToastTitle
source: Welcome back!
de: Willkommen zurück!

# authLoginSuccessToastDescription
source: Successfully logged in your account BeerCrackerz account. Grab a spot and a beer, and enjoy!
de: Sie haben sich erfolgreich in Ihrem BeerCrackerz-Konto angemeldet. Schnappen Sie sich einen Platz, ein Bier und genießen Sie es!

# authLoginTokenErrorToastTitle
source: Invalid token
de: Ungültiges Token

# authLoginTokenErrorToastDescription
source: The token sent back from server is either invalid or empty. Please contact support for assistance with error code LGI4.
de: Das vom Server zurückgesendete Token ist entweder ungültig oder leer. Bitte wenden Sie sich an den Support, um Hilfe beim Fehlercode LGI4 zu erhalten.

# authLoginUserInfoErrorToastTitle
source: Unable to get user info
de: Benutzerinformationen können nicht abgerufen werden

# authLoginUserInfoErrorToastDescription
source: The server couldn't give the user information back. Please contact support for assistance with error code LGI5.
de: Der Server konnte die Benutzerinformationen nicht zurückgeben. Bitte wenden Sie sich an den Support, um Hilfe beim Fehlercode LGI5 zu erhalten.

# authRegisterTitle
source: Register
de: Registrieren

# authRegisterUsernameInput
source: Enter your username
de: Geben Sie Ihren Benutzernamen ein

# authRegisterUsername
source: username
de: benutzernamen

# authRegisterUsernameAlreadyTaken
source: This username is already registered
de: Dieser Benutzername ist bereits registriert

# authRegisterEmailInput
source: Enter your email
de: Geben sie ihre E-Mail ein

# authRegisterEmailInvalid
source: This email is invalid
de: Diese E-Mail ist nicht gültig

# authRegisterEmailAlreadyTaken
source: This email is already registered
de: Diese E-Mail ist bereits registriert

# authRegisterPasswordInput
source: Enter your password
de: Geben Sie Ihr Passwort ein

# authRegisterPassword
source: password
de: passwort

# authRegisterPasswordTooCommon
source: This password is too common
de: Dieses Passwort ist zu häufig

# authRegisterPasswordNotStrongEnough
source: Password not strong enough
de: Passwort nicht stark genug

# authRegisterPasswordNotStrongEnoughToastTitle
source: About password strength
de: Über die Passwortstärke

# authRegisterPasswordNotStrongEnoughToastDescription
source: Your password must contain 8 or more characters, with at least one capital letter, one digit and one special character.
de: Ihr Passwort muss 8 oder mehr Zeichen enthalten, darunter mindestens einen Großbuchstaben, eine Ziffer und ein Sonderzeichen.

# authRegisterPasswordNotMatching
source: Passwords doesn't match
de: Passwörter stimmen nicht überein

# authRegisterRepeatPasswordInput
source: Repeat your password
de: Wiederhole dein Passwort

# authRegisterRepeatPassword
source: repeat password
de: wiederhole dein passwort

# authRegisterSubmit
source: Register
de: Registrieren

# authRegisterHaveAccount
source: You do have an account?
de: Haben Sie ein Konto?

# authRegisterLogin
source: Login
de: Anmeldung

# authRegisterSuccessTitle
source: Registration sent
de: Anmeldung verschickt

# authRegisterSuccessHeader
source: You're almost in!
de: Du bist fast drin!

# authRegisterSuccessContent
source: You are one step closer to edit the map and fully enjoy BeerCrackerz! Go check your mail and validate your account and then login.
de: Sie sind der Bearbeitung der Karte einen Schritt näher gekommen und können BeerCrackerz in vollen Zügen genießen! Überprüfen Sie Ihre E-Mails, validieren Sie Ihr Konto und melden Sie sich dann an.

# authRegisterSuccessSubmit
source: Dismiss
de: Zurückweisen

# authResetPasswordTitle
source: Reset password
de: Passwort zurücksetzen

# authResetPasswordInput
source: Enter your email
de: Geben sie ihre E-Mail ein

# authResetPasswordInvalidEmail
source: This email is invalid
de: Diese E-Mail ist nicht gültig

# authResetPasswordSubmit
source: Reset password
de: Passwort zurücksetzen

# authResetPasswordSuccessTitle
source: Reset password sent
de: Passwort zurücksetzen gesendet

# authResetPasswordSuccessHeader
source: Password almost reset!
de: Passwort fast zurückgesetzt!

# authResetPasswordSuccessContent
source: Now consult your emails and follow the link to set a new password on the web interface, then login again.
de: Sehen Sie sich nun Ihre E-Mails an und folgen Sie dem Link, um auf der Weboberfläche ein neues Passwort festzulegen. Melden Sie sich dann erneut an.

# authResetPasswordSuccessSubmit
source: Dismiss
de: Zurückweisen

# authProfileTitle
source: Profile
de: Profil

# authProfileCropTitle
source: Crop image
de: Bild zuschneiden

# authProfileFatalErrorTitle
source: Crop image error
de: Fehler beim Zuschneiden des Bildes

# authProfileFatalErrorContent
source: A fatal error occured whild opening image cropper. Please contact support for assistance.
de: Beim Öffnen des Bildzuschneideprogramms ist ein schwerwiegender Fehler aufgetreten. Bitte wenden Sie sich an den Support, um Hilfe zu erhalten.

# authProfileErrorMinimalPPSizeTitle
source: Invalid image size
de: Ungültige Bildgröße

# authProfileErrorMinimalPPSizeContent
source: The cropped image is bellow 512x512 pixels. Please provide an image with more pixels.
de: Das zugeschnittene Bild ist unter 512 x 512 Pixel groß. Bitte stellen Sie ein Bild mit mehr Pixeln zur Verfügung.

# authProfileErrorPPUploadErrorTitle
source: Image processing error
de: Bildverarbeitungsfehler

# authProfileErrorPPUploadErrorDescription
source: Something went wrong on the server with provided image. Please contact support for assistance with error code {field}.
de: Beim bereitgestellten Bild ist auf dem Server ein Fehler aufgetreten. Bitte wenden Sie sich an den Support, um Hilfe zum Fehlercode {field} zu erhalten.

# authProfileAboutBeerCrackerz
source: BeerCrackerz is the beer lovers comunity, filled with pint slayers and cereals lovers. A brilliant idea from David Béché, brought to life by Messe Basse Production! BeerCrackerz is an open source website and mobile application released under the GPL-3.0 licence.
de: BeerCrackerz ist die Community für Bierliebhaber, gefüllt mit Pint-Slayern und Müsliliebhabern. Eine clevere Idee von David Béché, umgesetzt von Messe Basse Production! BeerCrackerz ist eine Open-Source-Website und mobile Anwendung, die unter der GPL-3.0-Lizenz veröffentlicht wird.

# authProfileLogout
source: Logout
de: Ausloggen

# authProfileLogoutSuccessToastTitle
source: Logout success
de: Erfolgreiche Abmeldung

# authProfileLogoutSuccessToastDescription
source: You've been successfully logged out of your account. See you soon!
de: Sie wurden erfolgreich von Ihrem Konto abgemeldet. Bis bald!

# helpWelcomeTitle
source: Welcome
de: Willkommen

# helpWelcomeSlideTitle
source: Welcome to BeerCrackerz!
de: Willkommen bei BeerCrackerz!

# helpWelcomeSlideDescription
source: The app made by and for Beer lovers ; a community map where you will find the best spots around to enjoy a delightful beer. It also provides the nearest shops ands bars to refill your bag with the sweatests beers around. Anyone can register to contribute by adding their personnal best places to chill and enjoy a beer. With all that said, feel very welcome and enjoy the ride !
de: Die App von und für Bierliebhaber; Eine Community-Karte, auf der Sie die besten Orte finden, an denen Sie ein köstliches Bier genießen können. Es bietet auch die nächstgelegenen Geschäfte und Bars, in denen Sie Ihre Tasche mit den besten Bieren der Gegend auffüllen können. Jeder kann sich registrieren, um einen Beitrag zu leisten, indem er seine persönlichen besten Orte zum Entspannen und Genießen eines Bieres hinzufügt. Trotzdem: Fühlen Sie sich herzlich willkommen und genießen Sie die Fahrt!

# helpWelcomeMapSlideDescription
source: Spots are using green markers, shops are using blue ones and bars are in red. Keeping thing simple, to the essential : Beer.
de: Spots verwenden grüne Markierungen, Geschäfte verwenden blaue und Balken sind rot. Um es einfach und auf das Wesentliche zu beschränken: Bier.

# helpWelcomeMarkSlideDescription
source: When tapping on a mark, you will obtain useful information about it, filled by our generous and contributors.
de: Wenn Sie auf eine Markierung tippen, erhalten Sie nützliche Informationen darüber, die von unseren großzügigen Spendern ausgefüllt werden.

# helpWelcomeNewMarkSlideDescription
source: Finally, if you want to contribute and had your own locations to the map, you simply have to register an account. Your contributions are welcome!
de: Wenn Sie schließlich einen Beitrag zur Karte leisten möchten und über eigene Standorte verfügen, müssen Sie lediglich ein Konto registrieren. Ihre Beiträge sind willkommen!

# helpWelcomeCTASlideDescription
source: You're all set up, now you can freely browse the world to find the best place to drink a cold one around you, or you can register an account and start your contributor's career, in both case, have fun!
de: Sie haben alles vorbereitet, jetzt können Sie frei durch die Welt stöbern, um den besten Ort in Ihrer Nähe zu finden, an dem Sie ein kühles Getränk trinken können, oder Sie können ein Konto registrieren und Ihre Karriere als Mitwirkender beginnen – in beiden Fällen viel Spaß!

# helpWelcomeCTASlideShowWelcomeScreen
source: Show this helper on start
de: Zeigen Sie diesen Helfer beim Start an

# helpWelcomeCTASlideAuth
source: Account
de: Konto

# helpWelcomeCTASlideMap
source: Map
de: Schließen

# settingsTitle
source: Settings
de: Einstellungen

# settingsInterfaceSection
source: Interface
de: Schnittstelle

# settingsInterfaceLanguageSetting
source: Language
de: Sprache

# settingsInterfaceLanguageDialogTitle
source: Select language
de: Sprache auswählen

# settingsInterfaceLanguage
source: {feature, select, en{🇬🇧 English} fr{🇫🇷 French} es{🇪🇸 Spanish} de{🇩🇪 German} it{🇮🇹 Italian} pt{🇵🇹 Portuguese} other{Unknown}}
de: {feature, select, en{🇬🇧 Englisch} fr{🇫🇷 Französisch} es{🇪🇸 Spanisch} de{🇩🇪 Deutsch} it{🇮🇹 Italienisch} pt{🇵🇹 Portugiesisch} other{Unbekannt}}

# settingsInterfaceClose
source: Close
de: Schließen

# settingsInterfaceTheme
source: Dark Theme
de: Dunkles Thema

# settingsAppShowWelcomeScreenSetting
source: Show welcome screen
de: Begrüßungsbildschirm anzeigen

# settingsAppShowWelcomeScreenSettingDescription
source: Help panel on app startup
de: Hilfebereich beim App-Start

# emptyInput
source: The {field} field can not be empty
de: Das Feld {field} darf nicht leer sein

# spotFeatures
source: {feature, select, forest{Forest} river{River} lake{Lake} cliff{Cliff} mountain{Mountain} beach{Beach} sea{Sea} city{City} pov{Point of View} bench{Bench} covered{Covered} toilet{Toilet} store{Store nearby} trash{Trash} parking{Parking} other{Other}}
de: {feature, select, forest{Wald} river{Fluss} lake{See} cliff{Cliff} mountain{Berg} beach{Strand} sea{Meer} city{Stadt} pov{Standpunkt} bench{Bank} covered{Überdacht} toilet{Toilette} store{Geschäft in der Nähe} trash{Müll} parking{Parken} other{Andere}}

# shopFeatures
source: {feature, select, store{Grocery store} super{Supermarket} hyper{Hypermarket} cellar{Cellar} bio{Bio} craft{Craft} fresh{Refrigerated} card{Credit card} choice{Wide choice} other{Other}}
de: {feature, select, store{Lebensmittelgeschäft} super{Supermarkt} hyper{Hypermarkt} cellar{Keller} bio{Bio} craft{Handgemachtes} fresh{Gekühlt} card{Kreditkarte} choice{Große Auswahl} other{Andere}}

# barFeatures
source: {feature, select, regular{Regular} snack{Snack} cellar{Brewery} rooftop{Rooftop} tobacco{Cigarets} food{Food} card{Credit card} choice{Wide choice} outdoor{Outdoor} other{Other}}
de: {feature, select, regular{Regulär} snack{Snack} cellar{Brauerei} rooftop{Auf dem Dach} tobacco{Zigaretten} food{Essen} card{Kreditkarte} choice{Große Auswahl} outdoor{Draussen} other{Andere}}

# newSpotTitle
source: New spot
de: Neuer spot

# newSpotInformation
source: A spot is a remarkable place to crack a beer ! Share it with the community, wether it is for the astonishing view or for whatever it is enjoyable to drink a beer!
de: Ein Spot ist ein bemerkenswerter Ort, um ein Bier zu knacken! Teilen Sie es mit der Community, sei es wegen der atemberaubenden Aussicht oder weil es Spaß macht, ein Bier zu trinken!

# newSpotTypesTitle
source: What kind of spot it is?
de: Was ist das für ein Spot?

# newSpotDescriptionInput
source: Describe that spot
de: Beschreiben Sie diesen Spot

# newSpotModifiersTitle
source: Has it any specific features?
de: Hat es irgendwelche spezifischen Funktionen?

# newSpotRatingTitle
source: Give it a rate
de: Deine Bewertung

# newSpotSubmit
source: Save spot
de: Spot hinzufügen

# newShopTitle
source: New shop
de: Neuer Shop

# newShopInformation
source: The must have place to refill your beer stock. The more info you provide, the better you help your fellow BeerCrackerz!
de: Der unverzichtbare Ort, um Ihren Biervorrat aufzufüllen. Je mehr Informationen Sie bereitstellen, desto besser helfen Sie Ihren BeerCrackerz-Kollegen!

# newShopTypesTitle
source: What kind of shop it is?
de: Um was für einen Shop handelt es sich?

# newShopDescriptionInput
source: Describe that shop
de: Beschreiben Sie diesen Shop

# newShopModifiersTitle
source: Has it any specific features?
de: Hat es irgendwelche spezifischen Funktionen?

# newShopRatingTitle
source: Give it a rate
de: Deine Bewertung

# newShopPriceTitle
source: Give it a price
de: Ihr Tarif

# newShopSubmit
source: Save shop
de: Shop hinzufügen

# newBarTitle
source: New bar
de: Neue Bar

# newBarInformation
source: A bar is a holly place where you can get some nicely colded draft beers!
de: Eine Bar ist ein toller Ort, an dem man ein paar gut gekühlte Biere vom Fass bekommen kann!

# newBarNameInput
source: Bar name
de: Name der Bar

# newBarNameInputEmpty
source: Bar name
de: name der bar

# newBarTypesTitle
source: What kind of bar it is?
de: Was für eine Bar ist das?

# newBarDescriptionInput
source: Describe that bar
de: Beschreiben Sie diese Bar

# newBarModifiersTitle
source: Has it any specific features?
de: Hat es irgendwelche spezifischen Funktionen?

# newBarRatingTitle
source: Give it a rate
de: Deine Bewertung

# newBarPriceTitle
source: Give it a price
de: Ihr Tarif

# newBarSubmit
source: Add bar
de: Bar hinzufügen

# newMarkErrorToastTitle
source: Incomplete data
de: Unvollständige Daten

# editSpotTitle
source: Edit spot
de: Spot bearbeiten

# editShopTitle
source: Edit shop
de: Shop bearbeiten

# editBarTitle
source: Edit bar
de: Bar bearbeiten

# editMarkErrorToastTitle
source: Incomplete data
de: Unvollständige Daten

# editMarkErrorToastDescription
source: Please fill a title and a type for this mark. Please contact support for assistance with error code {field}.
de: Bitte hinterlegen Sie einen Titel und einen Typ für diese Marke. Bitte wenden Sie sich an den Support, um Hilfe zum Fehlercode {field} zu erhalten.

# deleteMarkDialogTitle
source: Delete marker
de: Markierung löschen

# deleteMarkDialogDescription
source: You're about to delete this point of interest, is that really what you want?
de: Sie sind dabei, diesen Markierung zu löschen. Ist das wirklich das, was Sie wollen?

# deleteMarkDialogYes
source: Yes
de: Ja

# deleteMarkDialogNo
source: No
de: Nein

# spotDiscoveredBy
source: A spot discovered by
de: Ein Spot entdeckt von

# shopDiscoveredBy
source: A shop discovered by
de: Ein Shop entdeckt von

# barDiscoveredBy
source: A bar discovered by
de: Ein Bar entdeckt von

# markDiscoveredSince
source: Since
de: Seit

# markEdit
source: Edit
de: Bearbeiten

# markDelete
source: Delete
de: Löschen

# mapLoginInfoTitle
source: About adding mark
de: Über das Hinzufügen von Markierungen

# mapLoginInfoDescription
source: In order to add your own mark to the map, you must be logged into your account. You can register a new account if you're not already a BeerCrackerz member!
de: Um Ihre eigene Markierung zur Karte hinzuzufügen, müssen Sie in Ihrem Konto angemeldet sein. Sie können ein neues Konto registrieren, wenn Sie noch kein BeerCrackerz-Mitglied sind!

# mapOptionsTitle
source: Map options
de: Kartenoptionen

# mapOptionsLayerStyle
source: Map layer style
de: Stil der Kartenebene

# mapOptionsLayerPlan
source: Plan
de: Kartenplan

# mapOptionsLayerSatellite
source: Satellite
de: Satellitenkarte

# mapOptionsDisplayedMarkers
source: Markers visibility
de: Sichtbarkeit der Markierungen

# mapOptionsDisplaySpots
source: Display spots
de: Anzeigespots

# mapOptionsDisplayShops
source: Display shops
de: Anzeigeshops

# mapOptionsDisplayBars
source: Display bars
de: Anzeigebars

# mapOSMContributors
source: OpenStreeMap contributors
de: OpenStreeMap-Mitwirkende

# mapEsriContributors
source: Powered by Esri
de: Unterstützt von Esri

# mapFlutterMapContributors
source: Flutter Map developers
de: Flutter Map-Entwickler
